005 Test/Stress Tests/Additional_information/BT02_Submit_Bundle.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2" xmlns:ec1="ec:schema:xsd:CommonAggregateComponents-2" xmlns:urn1="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2" xmlns:stan="http://www.unece.org/cefact/namespaces/StandardBusinessDocumentHeader" xmlns:sac="urn:oasis:names:specification:ubl:schema:xsd:SignatureAggregateComponents-2" xmlns:ec="ec:services:wsdl:DocumentBundle-2">
   <soapenv:Header>
      <ec:Header>
         <ec1:BusinessHeader>
            <stan:Sender>
               <stan:Identifier>TRUSTSUPPARTY1</stan:Identifier>
            </stan:Sender>
            <stan:Receiver>
               <stan:Identifier>TRUSTCUSTPARTY1</stan:Identifier>
            </stan:Receiver>
         </ec1:BusinessHeader>
      </ec:Header>
   </soapenv:Header>
   <soapenv:Body>
      <ec:SubmitDocumentBundleRequest>
         <ec:DocumentBundle>
            <urn1:ID>ID0000000001</urn1:ID>
            <urn1:IssueDate>2013-11-01</urn1:IssueDate>
            <urn:SenderParty/>
            <urn:ReceiverParty/>
            <ec1:DocumentWrapperReference>
               <urn1:ID>ID01</urn1:ID>
               <urn1:DocumentTypeCode>BINARY</urn1:DocumentTypeCode>
            </ec1:DocumentWrapperReference>
            <ec1:DocumentWrapperReference>
               <urn1:ID>ID02</urn1:ID>
               <urn1:DocumentTypeCode>BINARY</urn1:DocumentTypeCode>
            </ec1:DocumentWrapperReference>
            <ec1:DocumentWrapperReference>
               <urn1:ID>ID03</urn1:ID>
               <urn1:DocumentTypeCode>BINARY</urn1:DocumentTypeCode>
            </ec1:DocumentWrapperReference>
            <ec1:DocumentWrapperReference>
               <urn1:ID>ID04</urn1:ID>
               <urn1:DocumentTypeCode>BINARY</urn1:DocumentTypeCode>
            </ec1:DocumentWrapperReference>
            <ec1:DocumentWrapperReference>
               <urn1:ID>ID05</urn1:ID>
               <urn1:DocumentTypeCode>BINARY</urn1:DocumentTypeCode>
            </ec1:DocumentWrapperReference>
            <ec1:DocumentWrapperReference>
               <urn1:ID>ID06</urn1:ID>
               <urn1:DocumentTypeCode>BINARY</urn1:DocumentTypeCode>
            </ec1:DocumentWrapperReference>
            <ec1:DocumentWrapperReference>
               <urn1:ID>ID07</urn1:ID>
               <urn1:DocumentTypeCode>BINARY</urn1:DocumentTypeCode>
            </ec1:DocumentWrapperReference>
            <ec1:DocumentWrapperReference>
               <urn1:ID>ID08</urn1:ID>
               <urn1:DocumentTypeCode>BINARY</urn1:DocumentTypeCode>
            </ec1:DocumentWrapperReference>
            <ec1:DocumentWrapperReference>
               <urn1:ID>ID09</urn1:ID>
               <urn1:DocumentTypeCode>BINARY</urn1:DocumentTypeCode>
            </ec1:DocumentWrapperReference>
            <ec1:DocumentWrapperReference>
               <urn1:ID>ID10</urn1:ID>
               <urn1:DocumentTypeCode>BINARY</urn1:DocumentTypeCode>
            </ec1:DocumentWrapperReference>			
         </ec:DocumentBundle>
      </ec:SubmitDocumentBundleRequest>
   </soapenv:Body>
</soapenv:Envelope>
